/*=========================================================================*\
| Copyright (C) 2008 by the Board of Trustees of Michigan State University. |
| You may use this software under the terms of the GNU public license       |
| (GPL).  The terms of this license are described at:                       |
| http://www.gnu.org/licenses/gpl.txt                                       |
|                                                                           |
| Written by: E. Kasten                                                     |
\*=========================================================================*/

/*
  Change Log:
*/

static const char* Copyright= "(C) Copyright Michigan State University 2008, All rights reserved";

#include <config.h>

#include <CADC2530.h>
#include <string>
#include <unistd.h>
#include <string.h>
#include <math.h>

#include <assert.h>

using namespace std;


//   Convenience function for longword swapping.
#define swaplong(n)  (((n >> 16) & 0xffff) | ((n & 0xffff) << 16))

// Byte offset associated with a structure/field.
#define Offset(structname, field) ((unsigned int)&(((structname*)0x0)->field))

// Short and Long noffset associated with a struct/field.
#define ShortOffset(structname, field) (Offset(structname,field)/sizeof(short))
#define LongOffset(structname, field)  (Offset(structname,field)/sizeof(long))

// VME crate definitions
#define VME_CRATE_SIZE      24	// Slots in a VME crate.

// ADC2530 register and memory sizes and offsets
#define CADC2530_REGSIZE       0xC0      // Size of register set.
#define CADC2530_MEMSIZE       0x200000  // Size of all histo/list memory.
#define CADC2530_HISTOMEMSIZE  0x40000   // Size of histogram memory.
#define CADC2530_HISTOCHANSIZE 0x2000    // Size of histogram channel in longs.

// This value masks out (logical AND) the bits returned from a
// CSR read that should not be retained during a CSR set operation.
#define CADC2530_CSRMASK 0x00FF8A

// This value masks out (logical AND) the bits returned from a
// CTR read that should not be retained during a CTR set operation.
#define CADC2530_CTRMASK 0x00810F

// Defines for parsing list mode data blocks
#define IS_LIST_HEADER(x) (((((x>>24)&0x07) == 0x2)) ? true : false) 
#define IS_LIST_EOB(x) (((((x>>24)&0x07) == 0x4)) ? true : false) 
#define IS_LIST_CHANNEL(x) ((((x>>24)&0x07) == 0x0)) ? true : false) 
#define GET_LIST_CHANCOUNT(x) (((x>>8)&0x07)+1)
#define GET_LIST_CHANNUM(x) (((x>>16)&0x07)+1)
#define GET_LIST_CHANDATA(x) (x&0x1FFF)
#define GET_LIST_EVENTCOUNT(x) (x&0x00FFFFFF)

// Definition of the register and configuration memory.
typedef struct ADCregisters_struct {
  unsigned short  ManufacturerId;              // 0x00      (R)
  unsigned short  DeviceType;	               // 0x02      (R)
  unsigned short  CSR;                         // 0x04      (RW)
  unsigned short  MemoryOffset;                // 0x06      (RW)
  unsigned short  ListAddressLS;               // 0x08      (RW)
  unsigned short  ListAddressMS;               // 0x0A      (RW)
  unsigned short  InterruptVector;             // 0x0C      (RW)
  unsigned short  CTR;    	               // 0x0E      (RW)
  unsigned short  FullnessFlag;                // 0x10      (RW)
  unsigned short  InterruptMask;               // 0x12      (RW)
  unsigned short  LowerLevelDisc;              // 0x14      (RW)
  unsigned short  UpperLevelDisc;              // 0x16      (RW)
  unsigned short  EventCounterLS;              // 0x18      (RW)
  unsigned short  EventCounterMS;              // 0x1A      (RW)
  unsigned short  Conversion;                  // 0x1C      (R)
  unsigned short  SlidingScaleTest;            // 0x1E      (RW)
  unsigned short  NotUsed2[16]; 	       // 0x20-0x3F  
  unsigned short  SerialNumber;                // 0x40      (R) 
  unsigned short  DataInNonVolatileMem[63];    // 0x42-0xBF
} ADCregisters_t;

// Bit definition for the control and status register (CSR)
typedef union ADCcsr_union {
  unsigned short csrval;
  struct bit_struct {
    unsigned char RSTBSY : 1; // Read->Busy, Write->Reset (RW)
    unsigned char SS     : 1; // Enable sliding scale (0 is ON) (RW)
    unsigned char DR     : 1; // Data ready (R)
    unsigned char SC     : 1; // Set calibration on (RW)
    unsigned char FFCLR  : 1; // Force fast clear on all channesl (W)
    unsigned char ACM    : 1; // Auto memory clear (RW) (not completed)
    unsigned char IS     : 1; // Interrupt status (R)
    unsigned char IE     : 1; // Interrupt enable (RW)
    unsigned char ARM    : 1; // Start acquisition (RW)
    unsigned char IPL    : 3; // Set interrupt priority level (RW)
    unsigned char FHE    : 1; // Full/Half full or Event interrupt (RW)
    unsigned char ZE     : 1; // Enable zero conversion (RW)
