/*
		    GNU GENERAL PUBLIC LICENSE
		       Version 2, June 1991

 Copyright (C) 1989, 1991 Free Software Foundation, Inc.
                       59 Temple Place, Suite 330, Boston, MA  02111-1307  USA
 Everyone is permitted to copy and distribute verbatim copies
 of this license document, but changing it is not allowed.

			    Preamble

  The licenses for most software are designed to take away your
freedom to share and change it.  By contrast, the GNU General Public
License is intended to guarantee your freedom to share and change free
software--to make sure the software is free for all its users.  This
General Public License applies to most of the Free Software
Foundation's software and to any other program whose authors commit to
using it.  (Some other Free Software Foundation software is covered by
the GNU Library General Public License instead.)  You can apply it to
your programs, too.

  When we speak of free software, we are referring to freedom, not
price.  Our General Public Licenses are designed to make sure that you
have the freedom to distribute copies of free software (and charge for
this service if you wish), that you receive source code or can get it
if you want it, that you can change the software or use pieces of it
in new free programs; and that you know you can do these things.

  To protect your rights, we need to make restrictions that forbid
anyone to deny you these rights or to ask you to surrender the rights.

ask for permission.  For software which is copyrighted by the Free Software 
Foundation, write to the Free Software Foundation; we sometimes make 
exceptions for this.  Our decision will be guided by the two goals of 
preserving the free status of all derivatives of our free software and of 
promoting the sharing and reuse of software generally.

			    NO WARRANTY

  11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY FOR
THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN 
OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES PROVIDE 
THE PROGRAM "AS IS" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, 
INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND 
FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND 
PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE PROGRAM PROVE DEFECTIVE, 
YOU ASSUME THE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.

  12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING 
WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR 
REDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, 
INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING 
OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO 
LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR 
THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS), 
EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH 
DAMAGES.

		     END OF TERMS AND CONDITIONS
*/

/*
  Change Log:
  $Log$
  Revision 3.5  2003/06/19 19:09:17  ron-fox
  Rewrite to make both multi-crate safe and a little cleaner code.
  work around problems I'm seeing with word count field corruption.

  Revision 3.4  2003/06/06 11:40:11  ron-fox
  Remove some debug output now that everything works.

  Revision 3.3  2003/06/02 14:37:33  ron-fox
  Support multiple crates correctly.

*/

static const char* Copyright= "(C) Copyright Michigan State University 2002, All rights reserved";


#include "CAENcard.h"
#include <string>
#include <unistd.h>

//   Convenience function for longword swapping.
#define swaplong(n)  (((n >> 16) & 0xffff) | ((n & 0xffff) << 16))
//

#define VME_CRATE_SIZE      24	// Slots in a VME crate.

#define CAEN_REGISTERSIZE   0x2000 // Size of CAEN Register set.
#define CAEN_ROMSIZE        0x1000 // Size of CAEN ROM page.
#define CAEN_ROMOFFSET      0x8000 // Offset from base of ROM page.


// Bits we need in registers:

// Threshold memory.

#define KILLBIT  0x100		// Kill bit in threshold registers.

// Bit Set/Clear 1 register:

#define RESET       0x080
#define SELADDR     0x010

// Status register 1:


#define DREADY      0x001

// Bit Set/Clear 2 register.

#define OFFLINE     0x002
#define CLEARDATA   0x004
#define KEEPOVER    0x008
#define KEEPTHRESH  0x010
#define KEEPINVALID 0x020
#define COMMONSTOP  0x400

// The structure below represents the CAEN register set:
//

struct Registers {
  unsigned long   Buffer[0x1000/sizeof(long)]; // 0x0000
  unsigned short  FirmwareRev;                 // 0x1000
  unsigned short  GeoAddress;	               // 0x1002
  unsigned short  MCSTAddress;                 // 0x1004
  unsigned short  BitSet1;	               // 0x1006
  unsigned short  BitClear1;	               // 0x1008
  unsigned short  InterruptLevel;              // 0x100a
  unsigned short  InterruptVector;             // 0x100c
  unsigned short  Status1;	               // 0x100e
  unsigned short  Control1;                    // 0x1010
  unsigned short  HighAddress;	               // 0x1012
  unsigned short  LowAddress;                  // 0x1014
  unsigned short  Reset;                       // 0x1016
  unsigned short  pad1;                        // 0x1018
  unsigned short  MCSTControl;                 // 0x101a
  unsigned short  pad2;                        // 0x101c
  unsigned short  pad3;                        // 0x101e
  unsigned short  EventTrigger;	               // 0x1020
  unsigned short  Status2;                     // 0x1022
  unsigned short  EventCounterLow;             // 0x1024
  unsigned short  EventCounterHigh;            // 0x1026
  unsigned short  IncrementEvent;              // 0x1028
  unsigned short  IncrementOffset;             // 0x102a
  unsigned short  LoadTestRegister;            // 0x102c
  unsigned short  FCLRWindow;                  // 0x102e
  unsigned short  pad4;                        // 0x1030
  unsigned short  BitSet2;                     // 0x1032
  unsigned short  BitClear2;                   // 0x1034
  unsigned short  WMemoryTestAddress;          // 0x1036
  unsigned short  MemoryTestHigh;              // 0x1038
  unsigned short  MemoryTestLow;               // 0x103a
  unsigned short  CrateSelect;                 // 0x103c
  unsigned short  TestEventWrite;              // 0x103e
  unsigned short  EventCounterReset;           // 0x1040
  unsigned short  pad5[15];                    // 0x1042-105e
  unsigned short  TDCRange;                    // 0x1060
  unsigned short  pad7;                        // 0x1062
  unsigned short  RMemoryTestAddress;          // 0x1064
  unsigned short  pad8;                        // 0x1066
  unsigned short  SWComm;                      // 0x1068
  unsigned short  SlideConstant;               // 0x106a
  unsigned short  pad10;	               // 0x106c
  unsigned short  pad11;                       // 0x106e
  unsigned short  AAD;                         // 0x1070
  unsigned short  BAD;                         // 0x1072
  unsigned short  pad9[6];                     // 0x1074-107e
  unsigned short  Thresholds[32];              // 0x1080
  
};
#define QDCIPedestal TDCRange    // same register offsets.

// The structure below represents the part of the board ROM
// we care about... it holds a few chunks of useful info about
// the board:

struct ROM {
  unsigned short  pad1[0x26/sizeof(short)];  // 0x8000 - 0x8024
  unsigned short  OUIMSB;                    // 0x8026
  unsigned short  pad2;                      // 0x8028
  unsigned short  OUI;                       // 0x802a
  unsigned short  pad3;                      // 0x802c
  unsigned short  OUILSB;                    // 0x802e
  unsigned short  pad4;                      // 0x8030
  unsigned short  Version;                   // 0x8032
  unsigned short  pad5;                      // 0x8034
  unsigned short  BoardIdMSB;                // 0x8036
  unsigned short  pad6;                      // 0x8038
  unsigned short  BoardId;                   // 0x803a
  unsigned short  pad7;                      // 0x803c
  unsigned short  BoardIdLSB;                // 0x803e
  unsigned short  pad8[7];                   // 0x8040-0x804c
  unsigned short  Revision;                  // 0x804e
  unsigned short  pad9[0xb0/sizeof(short)];  // 0x8050 - 0x8100
  unsigned short  pad10[0xe00/sizeof(short)]; // 0x8100 - 0x8ffe
  unsigned short  pad11;                     // 0x8f00
  unsigned short  SerialMSB;                 // 0x8f02
  unsigned short  pad12;                     // 0x8f04
  unsigned short  SerialLSB;                 // 0x8f06
};


/*!
  Constructs a CAEN card.  The card can be addressed either
  geographically  or via base addres switches.  If geographical
  addressing is used, the slot value comes from the card position
  in the crate.  Otherwise it is programmed by the slotNum parameter.
  
  \param slotNum  This specifies the slot in the VME crate in 
  which the module resides.  If Geo is true, the module in that
  slot of the crate will be initialized.  If Geo is false, the
  module at physical address nBase will be initialized and its
  virtual slot number set to slotNum.
  
  
  \param crateNum The crate number in which the module lives.
  This selects which of the VME crates the module is in.  VME
  crate numbers can be determined using the cratelocator utility.
  The crate number is also programmed into the crate register so
  that the module crate field in the data stream is correct.
  
  \param Geo  
